Model: "gen_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 512)]             0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 1, 512)         0         
_________________________________________________________________
conv2d_transpose_004 (Conv2D (None, 4, 4, 512)         4194304   
_________________________________________________________________
batch_norm_004 (BatchNormali (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_relu_004 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
output_004 (Conv2DTranspose) (None, 4, 4, 3)           38400     
=================================================================
Total params: 4,234,752
Trainable params: 4,233,728
Non-trainable params: 1,024
_________________________________________________________________
