Model: "gen_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 512)]             0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 1, 512)         0         
_________________________________________________________________
conv2d_transpose_004 (Conv2D (None, 4, 4, 512)         4194304   
_________________________________________________________________
batch_norm_004 (BatchNormali (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_relu_004 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_transpose_008 (Conv2D (None, 8, 8, 256)         3276800   
_________________________________________________________________
batch_norm_008 (BatchNormali (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_relu_008 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_transpose_016 (Conv2D (None, 16, 16, 128)       819200    
_________________________________________________________________
batch_norm_016 (BatchNormali (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_relu_016 (LeakyReLU)   (None, 16, 16, 128)       0         
_________________________________________________________________
output_016 (Conv2DTranspose) (None, 16, 16, 3)         9600      
=================================================================
Total params: 8,303,488
Trainable params: 8,301,696
Non-trainable params: 1,792
_________________________________________________________________
