Model: "gen_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 512)]             0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 1, 512)         0         
_________________________________________________________________
conv2d_transpose_004 (Conv2D (None, 4, 4, 512)         4194304   
_________________________________________________________________
batch_norm_004 (BatchNormali (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_relu_004 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_transpose_008 (Conv2D (None, 8, 8, 256)         3276800   
_________________________________________________________________
batch_norm_008 (BatchNormali (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_relu_008 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
output_008 (Conv2DTranspose) (None, 8, 8, 3)           19200     
=================================================================
Total params: 7,493,376
Trainable params: 7,491,840
Non-trainable params: 1,536
_________________________________________________________________
