Model: "gen_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 512)]             0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 1, 512)         0         
_________________________________________________________________
conv2d_transpose_004 (Conv2D (None, 4, 4, 512)         4194304   
_________________________________________________________________
batch_norm_004 (BatchNormali (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_relu_004 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_transpose_008 (Conv2D (None, 8, 8, 256)         3276800   
_________________________________________________________________
batch_norm_008 (BatchNormali (None, 8, 8, 256)         1024      
_________________________________________________________________
leaky_relu_008 (LeakyReLU)   (None, 8, 8, 256)         0         
_________________________________________________________________
conv2d_transpose_016 (Conv2D (None, 16, 16, 128)       819200    
_________________________________________________________________
batch_norm_016 (BatchNormali (None, 16, 16, 128)       512       
_________________________________________________________________
leaky_relu_016 (LeakyReLU)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_transpose_032 (Conv2D (None, 32, 32, 64)        204800    
_________________________________________________________________
batch_norm_032 (BatchNormali (None, 32, 32, 64)        256       
_________________________________________________________________
leaky_relu_032 (LeakyReLU)   (None, 32, 32, 64)        0         
_________________________________________________________________
output_032 (Conv2DTranspose) (None, 32, 32, 3)         4800      
=================================================================
Total params: 8,503,744
Trainable params: 8,501,824
Non-trainable params: 1,920
_________________________________________________________________
