Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 128, 128, 3) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 128, 128, 16) 1216        input_2[0][0]                    
__________________________________________________________________________________________________
layer_normalization (LayerNorma (None, 128, 128, 16) 32          conv2d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 128, 128, 16) 0           layer_normalization[0][0]        
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 64, 64, 3)    0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 32)   12832       leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 64, 64, 32)   2432        average_pooling2d[0][0]          
__________________________________________________________________________________________________
average (Average)               (None, 64, 64, 32)   0           conv2d_1[0][0]                   
                                                                 conv2d_2[0][0]                   
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 64, 64, 32)   64          average[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 64, 64, 32)   0           layer_normalization_1[0][0]      
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 32, 32, 3)    0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 64)   51264       leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 64)   4864        average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
average_1 (Average)             (None, 32, 32, 64)   0           conv2d_3[0][0]                   
                                                                 conv2d_4[0][0]                   
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 32, 32, 64)   128         average_1[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 32, 32, 64)   0           layer_normalization_2[0][0]      
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 16, 16, 3)    0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 128)  204928      leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 128)  9728        average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
average_2 (Average)             (None, 16, 16, 128)  0           conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 16, 16, 128)  256         average_2[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 16, 16, 128)  0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 8, 8, 3)      0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 8, 8, 256)    819456      leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 8, 8, 256)    19456       average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
average_3 (Average)             (None, 8, 8, 256)    0           conv2d_7[0][0]                   
                                                                 conv2d_8[0][0]                   
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 8, 8, 256)    512         average_3[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 8, 8, 256)    0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 4, 4, 3)      0           average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 4, 4, 512)    3277312     leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 4, 4, 512)    38912       average_pooling2d_4[0][0]        
__________________________________________________________________________________________________
average_4 (Average)             (None, 4, 4, 512)    0           conv2d_9[0][0]                   
                                                                 conv2d_10[0][0]                  
__________________________________________________________________________________________________
layer_normalization_5 (LayerNor (None, 4, 4, 512)    1024        average_4[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 4, 4, 512)    0           layer_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 1, 1, 128)    1048704     leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
layer_normalization_6 (LayerNor (None, 1, 1, 128)    256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 1, 1, 128)    0           layer_normalization_6[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 128)          0           leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            129         flatten[0][0]                    
==================================================================================================
Total params: 5,493,505
Trainable params: 5,493,505
Non-trainable params: 0
__________________________________________________________________________________________________
