Model: "disc_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 4, 4, 3)]         0         
_________________________________________________________________
conv2d_004 (Conv2D)          (None, 4, 4, 512)         38912     
_________________________________________________________________
layer_norm_004 (LayerNormali (None, 4, 4, 512)         1024      
_________________________________________________________________
leaky_relu_004 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
conv2d_001 (Conv2D)          (None, 1, 1, 512)         4194816   
_________________________________________________________________
layer_norm_001 (LayerNormali (None, 1, 1, 512)         1024      
_________________________________________________________________
leaky_relu_001 (LeakyReLU)   (None, 1, 1, 512)         0         
_________________________________________________________________
flatten (Flatten)            (None, 512)               0         
_________________________________________________________________
output (Dense)               (None, 1)                 513       
=================================================================
Total params: 4,236,289
Trainable params: 4,236,289
Non-trainable params: 0
_________________________________________________________________
