Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 64, 64, 3)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 64, 64, 64)   1792        input_2[0][0]                    
__________________________________________________________________________________________________
layer_normalization (LayerNorma (None, 64, 64, 64)   128         conv2d[0][0]                     
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, 64, 64, 64)   0           layer_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 64, 64, 64)   36928       leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
layer_normalization_1 (LayerNor (None, 64, 64, 64)   128         conv2d_1[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, 64, 64, 64)   0           layer_normalization_1[0][0]      
__________________________________________________________________________________________________
average_pooling2d (AveragePooli (None, 32, 32, 3)    0           input_2[0][0]                    
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 32, 32, 128)  73856       leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 32, 32, 128)  3584        average_pooling2d[0][0]          
__________________________________________________________________________________________________
average_4 (Average)             (None, 32, 32, 128)  0           conv2d_2[0][0]                   
                                                                 conv2d_3[0][0]                   
__________________________________________________________________________________________________
layer_normalization_2 (LayerNor (None, 32, 32, 128)  256         average_4[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_12 (LeakyReLU)      (None, 32, 32, 128)  0           layer_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 32, 32, 128)  147584      leaky_re_lu_12[0][0]             
__________________________________________________________________________________________________
layer_normalization_3 (LayerNor (None, 32, 32, 128)  256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_13 (LeakyReLU)      (None, 32, 32, 128)  0           layer_normalization_3[0][0]      
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 16, 16, 3)    0           average_pooling2d[0][0]          
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 16, 16, 256)  295168      leaky_re_lu_13[0][0]             
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 16, 16, 256)  7168        average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
average_5 (Average)             (None, 16, 16, 256)  0           conv2d_5[0][0]                   
                                                                 conv2d_6[0][0]                   
__________________________________________________________________________________________________
layer_normalization_4 (LayerNor (None, 16, 16, 256)  512         average_5[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_14 (LeakyReLU)      (None, 16, 16, 256)  0           layer_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 16, 16, 256)  590080      leaky_re_lu_14[0][0]             
__________________________________________________________________________________________________
layer_normalization_5 (LayerNor (None, 16, 16, 256)  512         conv2d_7[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_15 (LeakyReLU)      (None, 16, 16, 256)  0           layer_normalization_5[0][0]      
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 8, 8, 3)      0           average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 8, 8, 512)    1180160     leaky_re_lu_15[0][0]             
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 8, 8, 512)    14336       average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
average_6 (Average)             (None, 8, 8, 512)    0           conv2d_8[0][0]                   
                                                                 conv2d_9[0][0]                   
__________________________________________________________________________________________________
layer_normalization_6 (LayerNor (None, 8, 8, 512)    1024        average_6[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_16 (LeakyReLU)      (None, 8, 8, 512)    0           layer_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 8, 8, 512)    2359808     leaky_re_lu_16[0][0]             
__________________________________________________________________________________________________
layer_normalization_7 (LayerNor (None, 8, 8, 512)    1024        conv2d_10[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_17 (LeakyReLU)      (None, 8, 8, 512)    0           layer_normalization_7[0][0]      
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 4, 4, 3)      0           average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 4, 4, 512)    2359808     leaky_re_lu_17[0][0]             
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 4, 4, 512)    14336       average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
average_7 (Average)             (None, 4, 4, 512)    0           conv2d_11[0][0]                  
                                                                 conv2d_12[0][0]                  
__________________________________________________________________________________________________
layer_normalization_8 (LayerNor (None, 4, 4, 512)    1024        average_7[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_18 (LeakyReLU)      (None, 4, 4, 512)    0           layer_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 4, 4, 512)    2359808     leaky_re_lu_18[0][0]             
__________________________________________________________________________________________________
layer_normalization_9 (LayerNor (None, 4, 4, 512)    1024        conv2d_13[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_19 (LeakyReLU)      (None, 4, 4, 512)    0           layer_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 1, 1, 128)    1048704     leaky_re_lu_19[0][0]             
__________________________________________________________________________________________________
layer_normalization_10 (LayerNo (None, 1, 1, 128)    256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
leaky_re_lu_20 (LeakyReLU)      (None, 1, 1, 128)    0           layer_normalization_10[0][0]     
__________________________________________________________________________________________________
flatten (Flatten)               (None, 128)          0           leaky_re_lu_20[0][0]             
__________________________________________________________________________________________________
dense (Dense)                   (None, 1)            129         flatten[0][0]                    
==================================================================================================
Total params: 10,499,393
Trainable params: 10,499,393
Non-trainable params: 0
__________________________________________________________________________________________________
