Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_2 (InputLayer)           [(None, 128, 128, 3  0           []                               
                                )]                                                                
                                                                                                  
 conv2d (Conv2D)                (None, 128, 128, 32  128         ['input_2[0][0]']                
                                )                                                                 
                                                                                                  
 layer_normalization (LayerNorm  (None, 128, 128, 32  64         ['conv2d[0][0]']                 
 alization)                     )                                                                 
                                                                                                  
 leaky_re_lu_12 (LeakyReLU)     (None, 128, 128, 32  0           ['layer_normalization[0][0]']    
                                )                                                                 
                                                                                                  
 conv2d_1 (Conv2D)              (None, 128, 128, 64  18496       ['leaky_re_lu_12[0][0]']         
                                )                                                                 
                                                                                                  
 layer_normalization_1 (LayerNo  (None, 128, 128, 64  128        ['conv2d_1[0][0]']               
 rmalization)                   )                                                                 
                                                                                                  
 leaky_re_lu_13 (LeakyReLU)     (None, 128, 128, 64  0           ['layer_normalization_1[0][0]']  
                                )                                                                 
                                                                                                  
 average_pooling2d (AveragePool  (None, 64, 64, 3)   0           ['input_2[0][0]']                
 ing2D)                                                                                           
                                                                                                  
 conv2d_2 (Conv2D)              (None, 64, 64, 64)   36928       ['leaky_re_lu_13[0][0]']         
                                                                                                  
 conv2d_3 (Conv2D)              (None, 64, 64, 64)   256         ['average_pooling2d[0][0]']      
                                                                                                  
 layer_normalization_2 (LayerNo  (None, 64, 64, 64)  128         ['conv2d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 layer_normalization_3 (LayerNo  (None, 64, 64, 64)  128         ['conv2d_3[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_14 (LeakyReLU)     (None, 64, 64, 64)   0           ['layer_normalization_2[0][0]']  
                                                                                                  
 leaky_re_lu_15 (LeakyReLU)     (None, 64, 64, 64)   0           ['layer_normalization_3[0][0]']  
                                                                                                  
 add_5 (Add)                    (None, 64, 64, 64)   0           ['leaky_re_lu_14[0][0]',         
                                                                  'leaky_re_lu_15[0][0]']         
                                                                                                  
 conv2d_4 (Conv2D)              (None, 64, 64, 128)  73856       ['add_5[0][0]']                  
                                                                                                  
 layer_normalization_4 (LayerNo  (None, 64, 64, 128)  256        ['conv2d_4[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_16 (LeakyReLU)     (None, 64, 64, 128)  0           ['layer_normalization_4[0][0]']  
                                                                                                  
 average_pooling2d_1 (AveragePo  (None, 32, 32, 3)   0           ['average_pooling2d[0][0]']      
 oling2D)                                                                                         
                                                                                                  
 conv2d_5 (Conv2D)              (None, 32, 32, 128)  147584      ['leaky_re_lu_16[0][0]']         
                                                                                                  
 conv2d_6 (Conv2D)              (None, 32, 32, 128)  512         ['average_pooling2d_1[0][0]']    
                                                                                                  
 layer_normalization_5 (LayerNo  (None, 32, 32, 128)  256        ['conv2d_5[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 layer_normalization_6 (LayerNo  (None, 32, 32, 128)  256        ['conv2d_6[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_17 (LeakyReLU)     (None, 32, 32, 128)  0           ['layer_normalization_5[0][0]']  
                                                                                                  
 leaky_re_lu_18 (LeakyReLU)     (None, 32, 32, 128)  0           ['layer_normalization_6[0][0]']  
                                                                                                  
 add_6 (Add)                    (None, 32, 32, 128)  0           ['leaky_re_lu_17[0][0]',         
                                                                  'leaky_re_lu_18[0][0]']         
                                                                                                  
 conv2d_7 (Conv2D)              (None, 32, 32, 256)  295168      ['add_6[0][0]']                  
                                                                                                  
 layer_normalization_7 (LayerNo  (None, 32, 32, 256)  512        ['conv2d_7[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_19 (LeakyReLU)     (None, 32, 32, 256)  0           ['layer_normalization_7[0][0]']  
                                                                                                  
 average_pooling2d_2 (AveragePo  (None, 16, 16, 3)   0           ['average_pooling2d_1[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_8 (Conv2D)              (None, 16, 16, 256)  590080      ['leaky_re_lu_19[0][0]']         
                                                                                                  
 conv2d_9 (Conv2D)              (None, 16, 16, 256)  1024        ['average_pooling2d_2[0][0]']    
                                                                                                  
 layer_normalization_8 (LayerNo  (None, 16, 16, 256)  512        ['conv2d_8[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 layer_normalization_9 (LayerNo  (None, 16, 16, 256)  512        ['conv2d_9[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_20 (LeakyReLU)     (None, 16, 16, 256)  0           ['layer_normalization_8[0][0]']  
                                                                                                  
 leaky_re_lu_21 (LeakyReLU)     (None, 16, 16, 256)  0           ['layer_normalization_9[0][0]']  
                                                                                                  
 add_7 (Add)                    (None, 16, 16, 256)  0           ['leaky_re_lu_20[0][0]',         
                                                                  'leaky_re_lu_21[0][0]']         
                                                                                                  
 conv2d_10 (Conv2D)             (None, 16, 16, 512)  1180160     ['add_7[0][0]']                  
                                                                                                  
 layer_normalization_10 (LayerN  (None, 16, 16, 512)  1024       ['conv2d_10[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_22 (LeakyReLU)     (None, 16, 16, 512)  0           ['layer_normalization_10[0][0]'] 
                                                                                                  
 average_pooling2d_3 (AveragePo  (None, 8, 8, 3)     0           ['average_pooling2d_2[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_11 (Conv2D)             (None, 8, 8, 512)    2359808     ['leaky_re_lu_22[0][0]']         
                                                                                                  
 conv2d_12 (Conv2D)             (None, 8, 8, 512)    2048        ['average_pooling2d_3[0][0]']    
                                                                                                  
 layer_normalization_11 (LayerN  (None, 8, 8, 512)   1024        ['conv2d_11[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 layer_normalization_12 (LayerN  (None, 8, 8, 512)   1024        ['conv2d_12[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_23 (LeakyReLU)     (None, 8, 8, 512)    0           ['layer_normalization_11[0][0]'] 
                                                                                                  
 leaky_re_lu_24 (LeakyReLU)     (None, 8, 8, 512)    0           ['layer_normalization_12[0][0]'] 
                                                                                                  
 add_8 (Add)                    (None, 8, 8, 512)    0           ['leaky_re_lu_23[0][0]',         
                                                                  'leaky_re_lu_24[0][0]']         
                                                                                                  
 conv2d_13 (Conv2D)             (None, 8, 8, 512)    2359808     ['add_8[0][0]']                  
                                                                                                  
 layer_normalization_13 (LayerN  (None, 8, 8, 512)   1024        ['conv2d_13[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_25 (LeakyReLU)     (None, 8, 8, 512)    0           ['layer_normalization_13[0][0]'] 
                                                                                                  
 average_pooling2d_4 (AveragePo  (None, 4, 4, 3)     0           ['average_pooling2d_3[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_14 (Conv2D)             (None, 4, 4, 512)    2359808     ['leaky_re_lu_25[0][0]']         
                                                                                                  
 conv2d_15 (Conv2D)             (None, 4, 4, 512)    2048        ['average_pooling2d_4[0][0]']    
                                                                                                  
 layer_normalization_14 (LayerN  (None, 4, 4, 512)   1024        ['conv2d_14[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 layer_normalization_15 (LayerN  (None, 4, 4, 512)   1024        ['conv2d_15[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_26 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_14[0][0]'] 
                                                                                                  
 leaky_re_lu_27 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_15[0][0]'] 
                                                                                                  
 add_9 (Add)                    (None, 4, 4, 512)    0           ['leaky_re_lu_26[0][0]',         
                                                                  'leaky_re_lu_27[0][0]']         
                                                                                                  
 conv2d_16 (Conv2D)             (None, 4, 4, 512)    2359808     ['add_9[0][0]']                  
                                                                                                  
 layer_normalization_16 (LayerN  (None, 4, 4, 512)   1024        ['conv2d_16[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_28 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_16[0][0]'] 
                                                                                                  
 conv2d_17 (Conv2D)             (None, 4, 4, 512)    4194816     ['leaky_re_lu_28[0][0]']         
                                                                                                  
 layer_normalization_17 (LayerN  (None, 4, 4, 512)   1024        ['conv2d_17[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_29 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_17[0][0]'] 
                                                                                                  
 flatten (Flatten)              (None, 8192)         0           ['leaky_re_lu_29[0][0]']         
                                                                                                  
 dense (Dense)                  (None, 1)            8193        ['flatten[0][0]']                
                                                                                                  
==================================================================================================
Total params: 16,001,473
Trainable params: 16,001,473
Non-trainable params: 0
__________________________________________________________________________________________________
