Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 1, 128)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 4, 4, 512)    1048576     reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 4, 4, 512)    2048        conv2d_transpose[0][0]           
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 4, 4, 512)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 4, 4, 512)    2359296     leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 4, 4, 512)    2048        conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 4, 4, 512)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 8, 8, 512)    2359296     leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 8, 8, 512)    2048        conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 8, 8, 512)    0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 8, 8, 512)    2359296     leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 8, 8, 512)    2048        conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 8, 8, 512)    0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 16, 16, 256)  1179648     leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 16, 16, 256)  1024        conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 16, 16, 256)  0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 16, 16, 256)  589824      leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 16, 16, 256)  1024        conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 16, 16, 256)  0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 32, 32, 128)  294912      leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 32, 32, 128)  512         conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, 32, 32, 128)  0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 32, 32, 128)  147456      leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 32, 32, 128)  512         conv2d_transpose_10[0][0]        
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 4, 4, 3)      1536        leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, 32, 32, 128)  0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 8, 8, 3)      0           conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 8, 8, 3)      1536        leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_12 (Conv2DTran (None, 64, 64, 64)   73728       leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
average (Average)               (None, 8, 8, 3)      0           up_sampling2d[0][0]              
                                                                 conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 64)   256         conv2d_transpose_12[0][0]        
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 16, 16, 3)    0           average[0][0]                    
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 16, 16, 3)    768         leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, 64, 64, 64)   0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
average_1 (Average)             (None, 16, 16, 3)    0           up_sampling2d_1[0][0]            
                                                                 conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_13 (Conv2DTran (None, 64, 64, 64)   36864       leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 32, 32, 3)    0           average_1[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 32, 32, 3)    384         leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 64, 64, 64)   256         conv2d_transpose_13[0][0]        
__________________________________________________________________________________________________
average_2 (Average)             (None, 32, 32, 3)    0           up_sampling2d_2[0][0]            
                                                                 conv2d_transpose_11[0][0]        
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, 64, 64, 64)   0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 64, 64, 3)    0           average_2[0][0]                  
__________________________________________________________________________________________________
conv2d_transpose_14 (Conv2DTran (None, 64, 64, 3)    192         leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
average_3 (Average)             (None, 64, 64, 3)    0           up_sampling2d_3[0][0]            
                                                                 conv2d_transpose_14[0][0]        
==================================================================================================
Total params: 10,465,088
Trainable params: 10,459,200
Non-trainable params: 5,888
__________________________________________________________________________________________________
