Model: "gen_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input (InputLayer)           [(None, 128)]             0         
_________________________________________________________________
reshape (Reshape)            (None, 1, 1, 128)         0         
_________________________________________________________________
conv2d_transpose_004 (Conv2D (None, 4, 4, 512)         1048576   
_________________________________________________________________
batch_norm_004 (BatchNormali (None, 4, 4, 512)         2048      
_________________________________________________________________
leaky_relu_004 (LeakyReLU)   (None, 4, 4, 512)         0         
_________________________________________________________________
output_004 (Conv2DTranspose) (None, 4, 4, 3)           38400     
=================================================================
Total params: 1,089,024
Trainable params: 1,088,000
Non-trainable params: 1,024
_________________________________________________________________
