Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 128)]        0           []                               
                                                                                                  
 reshape (Reshape)              (None, 1, 1, 128)    0           ['input_1[0][0]']                
                                                                                                  
 conv2d_transpose (Conv2DTransp  (None, 4, 4, 512)   1048576     ['reshape[0][0]']                
 ose)                                                                                             
                                                                                                  
 batch_normalization (BatchNorm  (None, 4, 4, 512)   2048        ['conv2d_transpose[0][0]']       
 alization)                                                                                       
                                                                                                  
 leaky_re_lu (LeakyReLU)        (None, 4, 4, 512)    0           ['batch_normalization[0][0]']    
                                                                                                  
 conv2d_transpose_2 (Conv2DTran  (None, 8, 8, 256)   1179648     ['leaky_re_lu[0][0]']            
 spose)                                                                                           
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 8, 8, 256)   1024        ['conv2d_transpose_2[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_1 (LeakyReLU)      (None, 8, 8, 256)    0           ['batch_normalization_1[0][0]']  
                                                                                                  
 conv2d_transpose_3 (Conv2DTran  (None, 8, 8, 256)   589824      ['leaky_re_lu_1[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 8, 8, 256)   1024        ['conv2d_transpose_3[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_2 (LeakyReLU)      (None, 8, 8, 256)    0           ['batch_normalization_2[0][0]']  
                                                                                                  
 conv2d_transpose_5 (Conv2DTran  (None, 16, 16, 128)  294912     ['leaky_re_lu_2[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 16, 16, 128)  512        ['conv2d_transpose_5[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_3 (LeakyReLU)      (None, 16, 16, 128)  0           ['batch_normalization_3[0][0]']  
                                                                                                  
 conv2d_transpose_6 (Conv2DTran  (None, 16, 16, 128)  147456     ['leaky_re_lu_3[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 16, 16, 128)  512        ['conv2d_transpose_6[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_4 (LeakyReLU)      (None, 16, 16, 128)  0           ['batch_normalization_4[0][0]']  
                                                                                                  
 conv2d_transpose_8 (Conv2DTran  (None, 32, 32, 64)  73728       ['leaky_re_lu_4[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 32, 32, 64)  256         ['conv2d_transpose_8[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_5 (LeakyReLU)      (None, 32, 32, 64)   0           ['batch_normalization_5[0][0]']  
                                                                                                  
 conv2d_transpose_9 (Conv2DTran  (None, 32, 32, 64)  36864       ['leaky_re_lu_5[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 32, 32, 64)  256         ['conv2d_transpose_9[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 conv2d_transpose_1 (Conv2DTran  (None, 4, 4, 3)     13824       ['leaky_re_lu[0][0]']            
 spose)                                                                                           
                                                                                                  
 leaky_re_lu_6 (LeakyReLU)      (None, 32, 32, 64)   0           ['batch_normalization_6[0][0]']  
                                                                                                  
 up_sampling2d (UpSampling2D)   (None, 8, 8, 3)      0           ['conv2d_transpose_1[0][0]']     
                                                                                                  
 conv2d_transpose_4 (Conv2DTran  (None, 8, 8, 3)     6912        ['leaky_re_lu_2[0][0]']          
 spose)                                                                                           
                                                                                                  
 conv2d_transpose_11 (Conv2DTra  (None, 64, 64, 32)  18432       ['leaky_re_lu_6[0][0]']          
 nspose)                                                                                          
                                                                                                  
 add (Add)                      (None, 8, 8, 3)      0           ['up_sampling2d[0][0]',          
                                                                  'conv2d_transpose_4[0][0]']     
                                                                                                  
 batch_normalization_7 (BatchNo  (None, 64, 64, 32)  128         ['conv2d_transpose_11[0][0]']    
 rmalization)                                                                                     
                                                                                                  
 up_sampling2d_1 (UpSampling2D)  (None, 16, 16, 3)   0           ['add[0][0]']                    
                                                                                                  
 conv2d_transpose_7 (Conv2DTran  (None, 16, 16, 3)   3456        ['leaky_re_lu_4[0][0]']          
 spose)                                                                                           
                                                                                                  
 leaky_re_lu_7 (LeakyReLU)      (None, 64, 64, 32)   0           ['batch_normalization_7[0][0]']  
                                                                                                  
 add_1 (Add)                    (None, 16, 16, 3)    0           ['up_sampling2d_1[0][0]',        
                                                                  'conv2d_transpose_7[0][0]']     
                                                                                                  
 conv2d_transpose_12 (Conv2DTra  (None, 64, 64, 32)  9216        ['leaky_re_lu_7[0][0]']          
 nspose)                                                                                          
                                                                                                  
 up_sampling2d_2 (UpSampling2D)  (None, 32, 32, 3)   0           ['add_1[0][0]']                  
                                                                                                  
 conv2d_transpose_10 (Conv2DTra  (None, 32, 32, 3)   1728        ['leaky_re_lu_6[0][0]']          
 nspose)                                                                                          
                                                                                                  
 batch_normalization_8 (BatchNo  (None, 64, 64, 32)  128         ['conv2d_transpose_12[0][0]']    
 rmalization)                                                                                     
                                                                                                  
 add_2 (Add)                    (None, 32, 32, 3)    0           ['up_sampling2d_2[0][0]',        
                                                                  'conv2d_transpose_10[0][0]']    
                                                                                                  
 leaky_re_lu_8 (LeakyReLU)      (None, 64, 64, 32)   0           ['batch_normalization_8[0][0]']  
                                                                                                  
 up_sampling2d_3 (UpSampling2D)  (None, 64, 64, 3)   0           ['add_2[0][0]']                  
                                                                                                  
 conv2d_transpose_13 (Conv2DTra  (None, 64, 64, 3)   864         ['leaky_re_lu_8[0][0]']          
 nspose)                                                                                          
                                                                                                  
 add_3 (Add)                    (None, 64, 64, 3)    0           ['up_sampling2d_3[0][0]',        
                                                                  'conv2d_transpose_13[0][0]']    
                                                                                                  
 activation (Activation)        (None, 64, 64, 3)    0           ['add_3[0][0]']                  
                                                                                                  
==================================================================================================
Total params: 3,431,328
Trainable params: 3,428,384
Non-trainable params: 2,944
__________________________________________________________________________________________________
