Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 128)]        0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, 1, 128)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_transpose (Conv2DTranspo (None, 4, 4, 512)    1048576     reshape[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 4, 4, 512)    2048        conv2d_transpose[0][0]           
__________________________________________________________________________________________________
leaky_re_lu (LeakyReLU)         (None, 4, 4, 512)    0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 8, 8, 512)    6553600     leaky_re_lu[0][0]                
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 8, 8, 512)    2048        conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, 8, 8, 512)    0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_4 (Conv2DTrans (None, 16, 16, 256)  3276800     leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 16, 16, 256)  1024        conv2d_transpose_4[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, 16, 16, 256)  0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 4, 4, 3)      38400       leaky_re_lu[0][0]                
__________________________________________________________________________________________________
conv2d_transpose_6 (Conv2DTrans (None, 32, 32, 128)  819200      leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_12 (Conv2DTran (None, 8, 8, 3)      81          conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_3 (Conv2DTrans (None, 8, 8, 3)      38400       leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 32, 32, 128)  512         conv2d_transpose_6[0][0]         
__________________________________________________________________________________________________
add (Add)                       (None, 8, 8, 3)      0           conv2d_transpose_12[0][0]        
                                                                 conv2d_transpose_3[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, 32, 32, 128)  0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_13 (Conv2DTran (None, 16, 16, 3)    81          add[0][0]                        
__________________________________________________________________________________________________
conv2d_transpose_5 (Conv2DTrans (None, 16, 16, 3)    19200       leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_8 (Conv2DTrans (None, 64, 64, 64)   204800      leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 16, 16, 3)    0           conv2d_transpose_13[0][0]        
                                                                 conv2d_transpose_5[0][0]         
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 64, 64, 64)   256         conv2d_transpose_8[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_14 (Conv2DTran (None, 32, 32, 3)    81          add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_transpose_7 (Conv2DTrans (None, 32, 32, 3)    9600        leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, 64, 64, 64)   0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
add_2 (Add)                     (None, 32, 32, 3)    0           conv2d_transpose_14[0][0]        
                                                                 conv2d_transpose_7[0][0]         
__________________________________________________________________________________________________
conv2d_transpose_10 (Conv2DTran (None, 128, 128, 32) 51200       leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
conv2d_transpose_15 (Conv2DTran (None, 64, 64, 3)    81          add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_transpose_9 (Conv2DTrans (None, 64, 64, 3)    4800        leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 32) 128         conv2d_transpose_10[0][0]        
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 64, 3)    0           conv2d_transpose_15[0][0]        
                                                                 conv2d_transpose_9[0][0]         
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, 128, 128, 32) 0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_transpose_16 (Conv2DTran (None, 128, 128, 3)  81          add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_transpose_11 (Conv2DTran (None, 128, 128, 3)  2400        leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 128, 128, 3)  0           conv2d_transpose_16[0][0]        
                                                                 conv2d_transpose_11[0][0]        
__________________________________________________________________________________________________
activation (Activation)         (None, 128, 128, 3)  0           add_4[0][0]                      
==================================================================================================
Total params: 12,073,397
Trainable params: 12,070,389
Non-trainable params: 3,008
__________________________________________________________________________________________________
