Model: "model"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(None, 128)]        0           []                               
                                                                                                  
 reshape (Reshape)              (None, 1, 1, 128)    0           ['input_1[0][0]']                
                                                                                                  
 conv2d_transpose (Conv2DTransp  (None, 4, 4, 512)   1048576     ['reshape[0][0]']                
 ose)                                                                                             
                                                                                                  
 batch_normalization (BatchNorm  (None, 4, 4, 512)   2048        ['conv2d_transpose[0][0]']       
 alization)                                                                                       
                                                                                                  
 leaky_re_lu (LeakyReLU)        (None, 4, 4, 512)    0           ['batch_normalization[0][0]']    
                                                                                                  
 conv2d_transpose_2 (Conv2DTran  (None, 8, 8, 512)   2359296     ['leaky_re_lu[0][0]']            
 spose)                                                                                           
                                                                                                  
 batch_normalization_1 (BatchNo  (None, 8, 8, 512)   2048        ['conv2d_transpose_2[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_1 (LeakyReLU)      (None, 8, 8, 512)    0           ['batch_normalization_1[0][0]']  
                                                                                                  
 conv2d_transpose_3 (Conv2DTran  (None, 8, 8, 512)   2359296     ['leaky_re_lu_1[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_2 (BatchNo  (None, 8, 8, 512)   2048        ['conv2d_transpose_3[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_2 (LeakyReLU)      (None, 8, 8, 512)    0           ['batch_normalization_2[0][0]']  
                                                                                                  
 conv2d_transpose_5 (Conv2DTran  (None, 16, 16, 256)  1179648    ['leaky_re_lu_2[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_3 (BatchNo  (None, 16, 16, 256)  1024       ['conv2d_transpose_5[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_3 (LeakyReLU)      (None, 16, 16, 256)  0           ['batch_normalization_3[0][0]']  
                                                                                                  
 conv2d_transpose_6 (Conv2DTran  (None, 16, 16, 256)  589824     ['leaky_re_lu_3[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_4 (BatchNo  (None, 16, 16, 256)  1024       ['conv2d_transpose_6[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_4 (LeakyReLU)      (None, 16, 16, 256)  0           ['batch_normalization_4[0][0]']  
                                                                                                  
 conv2d_transpose_8 (Conv2DTran  (None, 32, 32, 256)  589824     ['leaky_re_lu_4[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_5 (BatchNo  (None, 32, 32, 256)  1024       ['conv2d_transpose_8[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_5 (LeakyReLU)      (None, 32, 32, 256)  0           ['batch_normalization_5[0][0]']  
                                                                                                  
 conv2d_transpose_9 (Conv2DTran  (None, 32, 32, 256)  589824     ['leaky_re_lu_5[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_6 (BatchNo  (None, 32, 32, 256)  1024       ['conv2d_transpose_9[0][0]']     
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_6 (LeakyReLU)      (None, 32, 32, 256)  0           ['batch_normalization_6[0][0]']  
                                                                                                  
 conv2d_transpose_11 (Conv2DTra  (None, 64, 64, 128)  294912     ['leaky_re_lu_6[0][0]']          
 nspose)                                                                                          
                                                                                                  
 batch_normalization_7 (BatchNo  (None, 64, 64, 128)  512        ['conv2d_transpose_11[0][0]']    
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_7 (LeakyReLU)      (None, 64, 64, 128)  0           ['batch_normalization_7[0][0]']  
                                                                                                  
 conv2d_transpose_1 (Conv2DTran  (None, 4, 4, 3)     13824       ['leaky_re_lu[0][0]']            
 spose)                                                                                           
                                                                                                  
 conv2d_transpose_12 (Conv2DTra  (None, 64, 64, 128)  147456     ['leaky_re_lu_7[0][0]']          
 nspose)                                                                                          
                                                                                                  
 up_sampling2d (UpSampling2D)   (None, 8, 8, 3)      0           ['conv2d_transpose_1[0][0]']     
                                                                                                  
 conv2d_transpose_4 (Conv2DTran  (None, 8, 8, 3)     13824       ['leaky_re_lu_2[0][0]']          
 spose)                                                                                           
                                                                                                  
 batch_normalization_8 (BatchNo  (None, 64, 64, 128)  512        ['conv2d_transpose_12[0][0]']    
 rmalization)                                                                                     
                                                                                                  
 add (Add)                      (None, 8, 8, 3)      0           ['up_sampling2d[0][0]',          
                                                                  'conv2d_transpose_4[0][0]']     
                                                                                                  
 leaky_re_lu_8 (LeakyReLU)      (None, 64, 64, 128)  0           ['batch_normalization_8[0][0]']  
                                                                                                  
 up_sampling2d_1 (UpSampling2D)  (None, 16, 16, 3)   0           ['add[0][0]']                    
                                                                                                  
 conv2d_transpose_7 (Conv2DTran  (None, 16, 16, 3)   6912        ['leaky_re_lu_4[0][0]']          
 spose)                                                                                           
                                                                                                  
 conv2d_transpose_14 (Conv2DTra  (None, 128, 128, 64  73728      ['leaky_re_lu_8[0][0]']          
 nspose)                        )                                                                 
                                                                                                  
 add_1 (Add)                    (None, 16, 16, 3)    0           ['up_sampling2d_1[0][0]',        
                                                                  'conv2d_transpose_7[0][0]']     
                                                                                                  
 batch_normalization_9 (BatchNo  (None, 128, 128, 64  256        ['conv2d_transpose_14[0][0]']    
 rmalization)                   )                                                                 
                                                                                                  
 up_sampling2d_2 (UpSampling2D)  (None, 32, 32, 3)   0           ['add_1[0][0]']                  
                                                                                                  
 conv2d_transpose_10 (Conv2DTra  (None, 32, 32, 3)   6912        ['leaky_re_lu_6[0][0]']          
 nspose)                                                                                          
                                                                                                  
 leaky_re_lu_9 (LeakyReLU)      (None, 128, 128, 64  0           ['batch_normalization_9[0][0]']  
                                )                                                                 
                                                                                                  
 add_2 (Add)                    (None, 32, 32, 3)    0           ['up_sampling2d_2[0][0]',        
                                                                  'conv2d_transpose_10[0][0]']    
                                                                                                  
 conv2d_transpose_15 (Conv2DTra  (None, 128, 128, 64  36864      ['leaky_re_lu_9[0][0]']          
 nspose)                        )                                                                 
                                                                                                  
 up_sampling2d_3 (UpSampling2D)  (None, 64, 64, 3)   0           ['add_2[0][0]']                  
                                                                                                  
 conv2d_transpose_13 (Conv2DTra  (None, 64, 64, 3)   3456        ['leaky_re_lu_8[0][0]']          
 nspose)                                                                                          
                                                                                                  
 batch_normalization_10 (BatchN  (None, 128, 128, 64  256        ['conv2d_transpose_15[0][0]']    
 ormalization)                  )                                                                 
                                                                                                  
 add_3 (Add)                    (None, 64, 64, 3)    0           ['up_sampling2d_3[0][0]',        
                                                                  'conv2d_transpose_13[0][0]']    
                                                                                                  
 leaky_re_lu_10 (LeakyReLU)     (None, 128, 128, 64  0           ['batch_normalization_10[0][0]'] 
                                )                                                                 
                                                                                                  
 up_sampling2d_4 (UpSampling2D)  (None, 128, 128, 3)  0          ['add_3[0][0]']                  
                                                                                                  
 conv2d_transpose_16 (Conv2DTra  (None, 128, 128, 3)  1728       ['leaky_re_lu_10[0][0]']         
 nspose)                                                                                          
                                                                                                  
 add_4 (Add)                    (None, 128, 128, 3)  0           ['up_sampling2d_4[0][0]',        
                                                                  'conv2d_transpose_16[0][0]']    
                                                                                                  
 activation (Activation)        (None, 128, 128, 3)  0           ['add_4[0][0]']                  
                                                                                                  
==================================================================================================
Total params: 9,327,680
Trainable params: 9,321,792
Non-trainable params: 5,888
__________________________________________________________________________________________________
