Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_2 (InputLayer)           [(None, 64, 64, 3)]  0           []                               
                                                                                                  
 conv2d (Conv2D)                (None, 64, 64, 32)   896         ['input_2[0][0]']                
                                                                                                  
 layer_normalization (LayerNorm  (None, 64, 64, 32)  64          ['conv2d[0][0]']                 
 alization)                                                                                       
                                                                                                  
 leaky_re_lu_5 (LeakyReLU)      (None, 64, 64, 32)   0           ['layer_normalization[0][0]']    
                                                                                                  
 average_pooling2d (AveragePool  (None, 32, 32, 3)   0           ['input_2[0][0]']                
 ing2D)                                                                                           
                                                                                                  
 conv2d_1 (Conv2D)              (None, 32, 32, 64)   18496       ['leaky_re_lu_5[0][0]']          
                                                                                                  
 conv2d_2 (Conv2D)              (None, 32, 32, 64)   1792        ['average_pooling2d[0][0]']      
                                                                                                  
 average (Average)              (None, 32, 32, 64)   0           ['conv2d_1[0][0]',               
                                                                  'conv2d_2[0][0]']               
                                                                                                  
 layer_normalization_1 (LayerNo  (None, 32, 32, 64)  128         ['average[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_6 (LeakyReLU)      (None, 32, 32, 64)   0           ['layer_normalization_1[0][0]']  
                                                                                                  
 average_pooling2d_1 (AveragePo  (None, 16, 16, 3)   0           ['average_pooling2d[0][0]']      
 oling2D)                                                                                         
                                                                                                  
 conv2d_3 (Conv2D)              (None, 16, 16, 128)  73856       ['leaky_re_lu_6[0][0]']          
                                                                                                  
 conv2d_4 (Conv2D)              (None, 16, 16, 128)  3584        ['average_pooling2d_1[0][0]']    
                                                                                                  
 average_1 (Average)            (None, 16, 16, 128)  0           ['conv2d_3[0][0]',               
                                                                  'conv2d_4[0][0]']               
                                                                                                  
 layer_normalization_2 (LayerNo  (None, 16, 16, 128)  256        ['average_1[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_7 (LeakyReLU)      (None, 16, 16, 128)  0           ['layer_normalization_2[0][0]']  
                                                                                                  
 average_pooling2d_2 (AveragePo  (None, 8, 8, 3)     0           ['average_pooling2d_1[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_5 (Conv2D)              (None, 8, 8, 256)    295168      ['leaky_re_lu_7[0][0]']          
                                                                                                  
 conv2d_6 (Conv2D)              (None, 8, 8, 256)    7168        ['average_pooling2d_2[0][0]']    
                                                                                                  
 average_2 (Average)            (None, 8, 8, 256)    0           ['conv2d_5[0][0]',               
                                                                  'conv2d_6[0][0]']               
                                                                                                  
 layer_normalization_3 (LayerNo  (None, 8, 8, 256)   512         ['average_2[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_8 (LeakyReLU)      (None, 8, 8, 256)    0           ['layer_normalization_3[0][0]']  
                                                                                                  
 average_pooling2d_3 (AveragePo  (None, 4, 4, 3)     0           ['average_pooling2d_2[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_7 (Conv2D)              (None, 4, 4, 512)    1180160     ['leaky_re_lu_8[0][0]']          
                                                                                                  
 conv2d_8 (Conv2D)              (None, 4, 4, 512)    14336       ['average_pooling2d_3[0][0]']    
                                                                                                  
 average_3 (Average)            (None, 4, 4, 512)    0           ['conv2d_7[0][0]',               
                                                                  'conv2d_8[0][0]']               
                                                                                                  
 layer_normalization_4 (LayerNo  (None, 4, 4, 512)   1024        ['average_3[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_9 (LeakyReLU)      (None, 4, 4, 512)    0           ['layer_normalization_4[0][0]']  
                                                                                                  
 conv2d_9 (Conv2D)              (None, 1, 1, 128)    1048704     ['leaky_re_lu_9[0][0]']          
                                                                                                  
 layer_normalization_5 (LayerNo  (None, 1, 1, 128)   256         ['conv2d_9[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_10 (LeakyReLU)     (None, 1, 1, 128)    0           ['layer_normalization_5[0][0]']  
                                                                                                  
 flatten (Flatten)              (None, 128)          0           ['leaky_re_lu_10[0][0]']         
                                                                                                  
 dense (Dense)                  (None, 1)            129         ['flatten[0][0]']                
                                                                                                  
==================================================================================================
Total params: 2,646,529
Trainable params: 2,646,529
Non-trainable params: 0
__________________________________________________________________________________________________
