Model: "model_1"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_2 (InputLayer)           [(None, 64, 64, 3)]  0           []                               
                                                                                                  
 conv2d (Conv2D)                (None, 64, 64, 32)   896         ['input_2[0][0]']                
                                                                                                  
 layer_normalization (LayerNorm  (None, 64, 64, 32)  64          ['conv2d[0][0]']                 
 alization)                                                                                       
                                                                                                  
 leaky_re_lu_10 (LeakyReLU)     (None, 64, 64, 32)   0           ['layer_normalization[0][0]']    
                                                                                                  
 conv2d_1 (Conv2D)              (None, 64, 64, 32)   9248        ['leaky_re_lu_10[0][0]']         
                                                                                                  
 layer_normalization_1 (LayerNo  (None, 64, 64, 32)  64          ['conv2d_1[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_11 (LeakyReLU)     (None, 64, 64, 32)   0           ['layer_normalization_1[0][0]']  
                                                                                                  
 average_pooling2d (AveragePool  (None, 32, 32, 3)   0           ['input_2[0][0]']                
 ing2D)                                                                                           
                                                                                                  
 conv2d_2 (Conv2D)              (None, 32, 32, 64)   18496       ['leaky_re_lu_11[0][0]']         
                                                                                                  
 conv2d_3 (Conv2D)              (None, 32, 32, 64)   1792        ['average_pooling2d[0][0]']      
                                                                                                  
 layer_normalization_2 (LayerNo  (None, 32, 32, 64)  128         ['conv2d_2[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 layer_normalization_3 (LayerNo  (None, 32, 32, 64)  128         ['conv2d_3[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_12 (LeakyReLU)     (None, 32, 32, 64)   0           ['layer_normalization_2[0][0]']  
                                                                                                  
 leaky_re_lu_13 (LeakyReLU)     (None, 32, 32, 64)   0           ['layer_normalization_3[0][0]']  
                                                                                                  
 conv2d_4 (Conv2D)              (None, 32, 32, 64)   36928       ['leaky_re_lu_12[0][0]']         
                                                                                                  
 conv2d_5 (Conv2D)              (None, 32, 32, 64)   36928       ['leaky_re_lu_13[0][0]']         
                                                                                                  
 average (Average)              (None, 32, 32, 64)   0           ['conv2d_4[0][0]',               
                                                                  'conv2d_5[0][0]']               
                                                                                                  
 layer_normalization_4 (LayerNo  (None, 32, 32, 64)  128         ['average[0][0]']                
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_14 (LeakyReLU)     (None, 32, 32, 64)   0           ['layer_normalization_4[0][0]']  
                                                                                                  
 average_pooling2d_1 (AveragePo  (None, 16, 16, 3)   0           ['average_pooling2d[0][0]']      
 oling2D)                                                                                         
                                                                                                  
 conv2d_6 (Conv2D)              (None, 16, 16, 128)  73856       ['leaky_re_lu_14[0][0]']         
                                                                                                  
 conv2d_7 (Conv2D)              (None, 16, 16, 128)  3584        ['average_pooling2d_1[0][0]']    
                                                                                                  
 layer_normalization_5 (LayerNo  (None, 16, 16, 128)  256        ['conv2d_6[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 layer_normalization_6 (LayerNo  (None, 16, 16, 128)  256        ['conv2d_7[0][0]']               
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_15 (LeakyReLU)     (None, 16, 16, 128)  0           ['layer_normalization_5[0][0]']  
                                                                                                  
 leaky_re_lu_16 (LeakyReLU)     (None, 16, 16, 128)  0           ['layer_normalization_6[0][0]']  
                                                                                                  
 conv2d_8 (Conv2D)              (None, 16, 16, 128)  147584      ['leaky_re_lu_15[0][0]']         
                                                                                                  
 conv2d_9 (Conv2D)              (None, 16, 16, 128)  147584      ['leaky_re_lu_16[0][0]']         
                                                                                                  
 average_1 (Average)            (None, 16, 16, 128)  0           ['conv2d_8[0][0]',               
                                                                  'conv2d_9[0][0]']               
                                                                                                  
 layer_normalization_7 (LayerNo  (None, 16, 16, 128)  256        ['average_1[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_17 (LeakyReLU)     (None, 16, 16, 128)  0           ['layer_normalization_7[0][0]']  
                                                                                                  
 average_pooling2d_2 (AveragePo  (None, 8, 8, 3)     0           ['average_pooling2d_1[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_10 (Conv2D)             (None, 8, 8, 256)    295168      ['leaky_re_lu_17[0][0]']         
                                                                                                  
 conv2d_11 (Conv2D)             (None, 8, 8, 256)    7168        ['average_pooling2d_2[0][0]']    
                                                                                                  
 layer_normalization_8 (LayerNo  (None, 8, 8, 256)   512         ['conv2d_10[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 layer_normalization_9 (LayerNo  (None, 8, 8, 256)   512         ['conv2d_11[0][0]']              
 rmalization)                                                                                     
                                                                                                  
 leaky_re_lu_18 (LeakyReLU)     (None, 8, 8, 256)    0           ['layer_normalization_8[0][0]']  
                                                                                                  
 leaky_re_lu_19 (LeakyReLU)     (None, 8, 8, 256)    0           ['layer_normalization_9[0][0]']  
                                                                                                  
 conv2d_12 (Conv2D)             (None, 8, 8, 256)    590080      ['leaky_re_lu_18[0][0]']         
                                                                                                  
 conv2d_13 (Conv2D)             (None, 8, 8, 256)    590080      ['leaky_re_lu_19[0][0]']         
                                                                                                  
 average_2 (Average)            (None, 8, 8, 256)    0           ['conv2d_12[0][0]',              
                                                                  'conv2d_13[0][0]']              
                                                                                                  
 layer_normalization_10 (LayerN  (None, 8, 8, 256)   512         ['average_2[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_20 (LeakyReLU)     (None, 8, 8, 256)    0           ['layer_normalization_10[0][0]'] 
                                                                                                  
 average_pooling2d_3 (AveragePo  (None, 4, 4, 3)     0           ['average_pooling2d_2[0][0]']    
 oling2D)                                                                                         
                                                                                                  
 conv2d_14 (Conv2D)             (None, 4, 4, 512)    1180160     ['leaky_re_lu_20[0][0]']         
                                                                                                  
 conv2d_15 (Conv2D)             (None, 4, 4, 512)    14336       ['average_pooling2d_3[0][0]']    
                                                                                                  
 layer_normalization_11 (LayerN  (None, 4, 4, 512)   1024        ['conv2d_14[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 layer_normalization_12 (LayerN  (None, 4, 4, 512)   1024        ['conv2d_15[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_21 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_11[0][0]'] 
                                                                                                  
 leaky_re_lu_22 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_12[0][0]'] 
                                                                                                  
 conv2d_16 (Conv2D)             (None, 4, 4, 512)    2359808     ['leaky_re_lu_21[0][0]']         
                                                                                                  
 conv2d_17 (Conv2D)             (None, 4, 4, 512)    2359808     ['leaky_re_lu_22[0][0]']         
                                                                                                  
 average_3 (Average)            (None, 4, 4, 512)    0           ['conv2d_16[0][0]',              
                                                                  'conv2d_17[0][0]']              
                                                                                                  
 layer_normalization_13 (LayerN  (None, 4, 4, 512)   1024        ['average_3[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_23 (LeakyReLU)     (None, 4, 4, 512)    0           ['layer_normalization_13[0][0]'] 
                                                                                                  
 conv2d_18 (Conv2D)             (None, 1, 1, 128)    1048704     ['leaky_re_lu_23[0][0]']         
                                                                                                  
 layer_normalization_14 (LayerN  (None, 1, 1, 128)   256         ['conv2d_18[0][0]']              
 ormalization)                                                                                    
                                                                                                  
 leaky_re_lu_24 (LeakyReLU)     (None, 1, 1, 128)    0           ['layer_normalization_14[0][0]'] 
                                                                                                  
 flatten (Flatten)              (None, 128)          0           ['leaky_re_lu_24[0][0]']         
                                                                                                  
 dense (Dense)                  (None, 1)            129         ['flatten[0][0]']                
                                                                                                  
==================================================================================================
Total params: 8,928,481
Trainable params: 8,928,481
Non-trainable params: 0
__________________________________________________________________________________________________
